-- phpMyAdmin SQL Dump
-- version 4.4.15.7
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 22 2017 г., 15:55
-- Версия сервера: 5.5.50
-- Версия PHP: 5.6.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `praktika-it`
--

-- --------------------------------------------------------

--
-- Структура таблицы `weather`
--

CREATE TABLE IF NOT EXISTS `weather` (
  `city` text NOT NULL,
  `data` date NOT NULL,
  `data_time` datetime NOT NULL,
  `weather` text NOT NULL,
  `speed` int(11) NOT NULL,
  `clouds` int(11) NOT NULL,
  `temp` int(11) NOT NULL,
  `humidity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `weather`
--

INSERT INTO `weather` (`city`, `data`, `data_time`, `weather`, `speed`, `clouds`, `temp`, `humidity`) VALUES
('Poltava', '2017-06-22', '2017-06-22 15:00:00', 'облачно', 5, 24, 22, 41),
('Poltava', '2017-06-22', '2017-06-22 18:00:00', 'пасмурно', 4, 80, 20, 38),
('Poltava', '2017-06-22', '2017-06-22 21:00:00', 'слегка облачно', 2, 36, 16, 45),
('Poltava', '2017-06-23', '2017-06-23 00:00:00', 'пасмурно', 2, 64, 15, 52),
('Poltava', '2017-06-23', '2017-06-23 03:00:00', 'легкий дождь', 1, 48, 15, 60),
('Poltava', '2017-06-23', '2017-06-23 06:00:00', 'слегка облачно', 3, 48, 20, 54),
('Poltava', '2017-06-23', '2017-06-23 09:00:00', 'пасмурно', 6, 76, 22, 52),
('Poltava', '2017-06-23', '2017-06-23 12:00:00', 'пасмурно', 6, 92, 24, 49),
('Poltava', '2017-06-23', '2017-06-23 15:00:00', 'легкий дождь', 3, 92, 22, 53),
('Poltava', '2017-06-23', '2017-06-23 18:00:00', 'сильный дождь', 3, 92, 16, 100),
('Poltava', '2017-06-23', '2017-06-23 21:00:00', 'сильный дождь', 4, 92, 16, 100),
('Poltava', '2017-06-24', '2017-06-24 00:00:00', 'легкий дождь', 4, 64, 16, 99),
('Poltava', '2017-06-24', '2017-06-24 03:00:00', 'ясно', 4, 0, 16, 98),
('Poltava', '2017-06-24', '2017-06-24 06:00:00', 'облачно', 4, 12, 19, 96),
('Poltava', '2017-06-24', '2017-06-24 09:00:00', 'облачно', 4, 20, 21, 89),
('Poltava', '2017-06-24', '2017-06-24 12:00:00', 'облачно', 3, 12, 22, 82),
('Poltava', '2017-06-24', '2017-06-24 15:00:00', 'облачно', 2, 24, 22, 77),
('Poltava', '2017-06-24', '2017-06-24 18:00:00', 'пасмурно', 2, 68, 19, 77),
('Poltava', '2017-06-24', '2017-06-24 21:00:00', 'пасмурно', 3, 80, 18, 81),
('Poltava', '2017-06-25', '2017-06-25 00:00:00', 'пасмурно', 3, 76, 17, 85),
('Poltava', '2017-06-25', '2017-06-25 03:00:00', 'легкий дождь', 3, 36, 17, 89),
('Poltava', '2017-06-25', '2017-06-25 06:00:00', 'легкий дождь', 3, 12, 20, 100),
('Poltava', '2017-06-25', '2017-06-25 09:00:00', 'облачно', 5, 12, 23, 83),
('Poltava', '2017-06-25', '2017-06-25 12:00:00', 'облачно', 5, 24, 25, 74),
('Poltava', '2017-06-25', '2017-06-25 15:00:00', 'слегка облачно', 5, 32, 25, 66),
('Poltava', '2017-06-25', '2017-06-25 18:00:00', 'пасмурно', 4, 68, 24, 63),
('Poltava', '2017-06-25', '2017-06-25 21:00:00', 'облачно', 4, 12, 21, 71),
('Poltava', '2017-06-26', '2017-06-26 00:00:00', 'ясно', 5, 8, 20, 75),
('Poltava', '2017-06-26', '2017-06-26 03:00:00', 'слегка облачно', 5, 36, 21, 67),
('Poltava', '2017-06-26', '2017-06-26 06:00:00', 'слегка облачно', 6, 32, 25, 67),
('Poltava', '2017-06-26', '2017-06-26 09:00:00', 'пасмурно', 7, 100, 27, 65),
('Poltava', '2017-06-26', '2017-06-26 12:00:00', 'легкий дождь', 8, 88, 25, 63),
('Poltava', '2017-06-26', '2017-06-26 15:00:00', 'легкий дождь', 6, 36, 25, 69),
('Poltava', '2017-06-26', '2017-06-26 18:00:00', 'легкий дождь', 5, 0, 22, 77),
('Poltava', '2017-06-26', '2017-06-26 21:00:00', 'ясно', 2, 0, 18, 90);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
